<a href="https://colab.research.google.com/github/MahmudGalib7/AI-Olympiad/blob/master/data_analysis/notebook/learning_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [1]:
import pandas as pd
import numpy as np

# Basic Operations

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A", "B", "C"], index=["x", "y", "z", "zz"])

In [3]:
df

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [4]:
df.head()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [5]:
df.tail()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [6]:
df.sample(2)

   A  B  C
x  1  2  3
y  4  5  6

In [ ]:
df.columns

In [ ]:
df.index
df.index.tolist()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.nunique()

In [ ]:
df['A'].nunique()

In [ ]:
df.shape

In [ ]:
df.size

In [ ]:
df_new = df.copy()
df_new.drop(columns=['A'], inplace=True)

In [ ]:
df

In [ ]:
df_new

# Dataset

In [194]:
# drive

# coffee = pd.read_csv('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/warmup-data/coffee.csv')
# results = pd.read_parquet('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/data/results.parquet')
# olympics_data = pd.read_excel('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/data/olympics-data.xlsx')
# bios = pd.read_csv('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/data/bios.csv')
# nocs = pd.read_csv('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/data/noc_regions.csv')

# Local
coffee = pd.read_csv('Dataset/warmup-data/coffee.csv')
results = pd.read_parquet('Dataset/data/results.parquet')
olympics_data = pd.read_excel('Dataset/data/olympics-data.xlsx')
bios = pd.read_csv('Dataset/data/bios.csv')
nocs = pd.read_csv('Dataset/data/noc_regions.csv')

In [ ]:
coffee

In [ ]:
results

In [ ]:
olympics_data

In [ ]:
bios

# Accessing Data

In [ ]:
coffee.loc[0]
coffee.loc[[0,1,2]]
coffee.loc[5:12]
coffee.loc[5:8, ["Day", "Units Sold"]]

In [ ]:
coffee.iloc[0]
coffee.iloc[[0,1,2]]
coffee.iloc[5:12]
coffee.iloc[5:8, [0,2]]

In [ ]:
coffee.at[0, "Units Sold"]
coffee.iat[0, 2]

In [ ]:
coffee.index = coffee.Day
coffee.index = coffee["Day"]

coffee.loc["Monday":"Friday", "Units Sold"]

In [ ]:
coffee.loc[1, "Units Sold"] = 10
coffee.loc[1:3, "Units Sold"] = 10

In [ ]:
coffee.sort_values("Units Sold", ascending=False)
coffee.sort_values("Units Sold", ascending=[0,1])

In [ ]:
for index, row in coffee.iterrows():
    print(index)
    print(row["Units Sold"])
    print("\n \n")

# Filtering Data

In [ ]:
bios.info()
bios.loc[bios['height_cm'] > 215, ['name', 'height_cm']]
bios[bios['height_cm'] > 215][['name', 'height_cm']]
bios[(bios['height_cm'] > 215) & (bios['born_country']=='USA')]
bios[bios['name'].str.contains('Keith')]
bios[bios['name'].str.contains('keith', case=False)]
bios[bios['name'].str.contains('keith | patrick', case=False, regex=True)]
bios[bios['born_country'].isin(["USA", "FRA"])]
bios[bios['born_country'].isin(["USA", "FRA", "GBR"]) & (bios['name'].str.startswith('Keith'))]
bios.query('born_country == "USA" and born_city == "Seattle"')

# Adding / Removing Columns

In [195]:
coffee['price'] = 4.99
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [196]:
# coffee.drop(columns=["price"], inplace=True)
coffee = coffee[['Day', 'Coffee Type', 'Units Sold', 'new_price']]

In [197]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

In [198]:
coffee.rename(columns={"new_price":"price"}, inplace=True)

In [ ]:
coffee

In [ ]:
bios_new = bios.copy()

In [ ]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [ ]:
bios_new.query('first_name =="Keith"')

In [ ]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], errors='coerce', format='mixed')
bios_new['born_year'] = bios_new['born_datetime'].dt.year
# bios_new['born_year'] = bios_new['born_datetime'].dt.is_leap_year
bios_new[['name', 'born_year']]

In [ ]:
bios['height_catergory'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

In [ ]:
def categorize_athelete(row):
    if row['height_cm'] < 165 and row['weight_kg'] < 70:
        return "LightWeight"
    elif row['height_cm'] < 185 or row['weight_kg'] < 80:
        return "Middleweight"
    else:
        return "Heavyweight"
bios['weight_category'] = bios.apply(categorize_athelete, axis=1)

In [ ]:
bios

# Mergin and Concatenating Data

In [126]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [127]:
bios_new.rename(columns={"region":"born_country_full"}, inplace=True)

In [ ]:
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']][['NOC_x', 'born_country_full']]

In [131]:
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()

In [ ]:
usa
gbr

In [ ]:
new_df = pd.concat([usa, gbr])
new_df

In [138]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

# Handling NULL Values

In [199]:
coffee.loc[[2,3], 'Units Sold'] = np.nan

In [ ]:
coffee.info()
coffee.isna().sum()
coffee[coffee['Units Sold'].isna()]
coffee[coffee['Units Sold'].notna()]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
 3   price        14 non-null     float64
 4   revenue      14 non-null     float64
dtypes: float64(3), object(2)
memory usage: 692.0+ bytes

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

In [ ]:
coffee['Units Sold'] = coffee['Units Sold'].interpolate( )
coffee['Units Sold'] = coffee['Units Sold'].fillna(coffee['Units Sold'].mean())
coffee['Units Sold'] = coffee['Units Sold'].fillna(coffee['Units Sold'].median())
coffee['Units Sold'] = coffee['Units Sold'].fillna(coffee['Units Sold'].mode()[0])

coffee = coffee.dropna(subset=['Units Sold'])

In [201]:
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
2     Tuesday    Espresso         NaN   3.99   119.70
3     Tuesday       Latte         NaN   5.99   119.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

# Aggregating Data

In [207]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [208]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawai ªi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [216]:
coffee['Units Sold'] = coffee['Units Sold'].interpolate()
# coffee.groupby(['Coffee Type'])['Units Sold'].sum()
coffee.groupby(['Coffee Type', 'Day']).agg({'Units Sold':'sum', 'price':'mean'})

                       Units Sold  price
Coffee Type Day
Espresso    Friday      45.000000   3.99
            Monday      25.000000   3.99
            Saturday    45.000000   3.99
            Sunday      45.000000   3.99
            Thursday    40.000000   3.99
            Tuesday     21.666667   3.99
            Wednesday   35.000000   3.99
Latte       Friday      35.000000   5.99
            Monday      15.000000   5.99
            Saturday    35.000000   5.99
            Sunday      35.000000   5.99
            Thursday    30.000000   5.99
            Tuesday     28.333333   5.99
            Wednesday   25.000000   5.99

In [218]:
pivot = coffee.pivot(columns='Coffee Type', index='Day', values='revenue')

In [220]:
pivot
pivot.sum(axis=1)

Day
Friday       389.2
Monday       189.6
Saturday     389.2
Sunday       389.2
Thursday     339.3
Tuesday      239.5
Wednesday    289.4
dtype: float64

In [229]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios['month_born'] = bios['born_date'].dt.month
bios['year_born'] = bios['born_date'].dt.year
bios.groupby(['month_born', 'year_born'])['name'].count().reset_index().sort_values('name', ascending=False)

      month_born  year_born  name
124          1.0     1970.0   239
126          1.0     1972.0   229
129          1.0     1975.0   227
140          1.0     1986.0   227
139          1.0     1985.0   225
...          ...        ...   ...
165          2.0     1853.0     1
168          2.0     1859.0     1
172          2.0     1864.0     1
7            1.0     1852.0     1
1884        12.0     2006.0     1

[1885 rows x 3 columns]

# Saving filtered data

In [ ]:
# Drive
bios_new.to_csv('/content/drive/MyDrive/AI-Olympiad Notebook/Data Science/Dataset/data/new_bios.csv', index=False)

# Local
bios_new.to_csv('Dataset/data/new_bios.csv', index=False)